
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|   Success |   🟢 Add |   🟡 Change |    Destroy |
|----------:|---------:|------------:|-----------:|
|        ✅ |        2 |           5 |          0 |
## Affected resources by action

|  Action  | Resources                                                                   |
|:--------:|:----------------------------------------------------------------------------|
|    🟢    | `aws_iam_role_policy_attachment.registry-client["terraform-aws-dms"]`       |
|    🟢    | `module.registry-client-roles["terraform-aws-dms"].aws_iam_role.github`     |
|    🟡    | `module.jumphost.aws_autoscaling_group.jumphost`                            |
|    🟡    | `module.jumphost.aws_iam_policy.required`                                   |
|    🟡    | `module.jumphost.aws_launch_template.jumphost`                              |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website` |
|    🟡    | `module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website`   |
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # aws_iam_role_policy_attachment.registry-client["terraform-aws-dms"] will be created
  + resource "aws_iam_role_policy_attachment" "registry-client" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::493370826424:policy/registry-client20240303235455581600000001"
      + role       = "ih-tf-terraform-aws-dms-github"
    }

  # module.jumphost.data.aws_iam_policy_document.required_permissions will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "required_permissions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "autoscaling:DescribeAutoScalingInstances",
            ]
          + resources = [
              + "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ",
            ]
        }
    }

  # module.jumphost.aws_autoscaling_group.jumphost will be updated in-place
  ~ resource "aws_autoscaling_group" "jumphost" {
        id                               = "jumphost-20240223005113359100000009-02R7BZ"
        name                             = "jumphost-20240223005113359100000009-02R7BZ"
        # (31 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "16" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (10 unchanged blocks hidden)
    }

  # module.jumphost.aws_iam_policy.required will be updated in-place
  ~ resource "aws_iam_policy" "required" {
        id               = "arn:aws:iam::493370826424:policy/terraform-20240223005145929800000014"
        name             = "terraform-20240223005145929800000014"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "autoscaling:DescribeAutoScalingInstances"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:autoscaling:us-west-1:493370826424:autoScalingGroup:70d22604-e11b-4b9d-95e6-f5f41a1208d6:autoScalingGroupName/jumphost-20240223005113359100000009-02R7BZ"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (7 unchanged attributes hidden)
    }

  # module.jumphost.aws_launch_template.jumphost will be updated in-place
  ~ resource "aws_launch_template" "jumphost" {
        id                                   = "lt-001743d1d2257c40b"
      ~ image_id                             = "ami-01d7e909eb69d7ccd" -> "ami-02f2920ba1d21ece8"
      ~ latest_version                       = 16 -> (known after apply)
        name                                 = "jumphost-20240223005113359100000009"
        tags                                 = {
            "account"           = "493370826424"
            "created_by_module" = "infrahouse/jumphost/aws"
            "environment"       = "production"
            "service"           = "jumphost"
        }
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.registry-client-roles["terraform-aws-dms"].aws_iam_role.github will be created
  + resource "aws_iam_role" "github" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
                            }
                          + StringLike   = {
                              + "token.actions.githubusercontent.com:sub" = "repo:infrahouse/terraform-aws-dms:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Role for a GitHub Actions runner in repo terraform-aws-dms"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ih-tf-terraform-aws-dms-github"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "created_by_module" = "infrahouse/github-role/aws"
        }
      + tags_all              = {
          + "created_by"        = "infrahouse/aws-control-493370826424"
          + "created_by_module" = "infrahouse/github-role/aws"
          + "environment"       = "production"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_autoscaling_group.website will be updated in-place
  ~ resource "aws_autoscaling_group" "website" {
        id                               = "openvp2024070518391750040000001b"
        name                             = "openvp2024070518391750040000001b"
        # (32 unchanged attributes hidden)

      ~ mixed_instances_policy {
          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "18" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }

        # (12 unchanged blocks hidden)
    }

  # module.vpn.module.openvpn-portal.module.pod.aws_launch_template.website will be updated in-place
  ~ resource "aws_launch_template" "website" {
        id                                   = "lt-0ef83181fbf251354"
      ~ image_id                             = "ami-0509eb4a380d8a316" -> "ami-0163aebbfba1c3532"
      ~ latest_version                       = 18 -> (known after apply)
        name                                 = "openvp20240705183917137600000019"
        tags                                 = {}
        # (16 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

Plan: 2 to add, 5 to change, 0 to destroy.

Warning: Invalid Attribute Combination

  with module.management.aws_s3_bucket_lifecycle_configuration.vpc_flow_logs,
  on .terraform/modules/management/vpc_flow_logs.tf line 51, in resource "aws_s3_bucket_lifecycle_configuration" "vpc_flow_logs":
  51:     filter {}

No attribute specified when one (and only one) of
[rule[0].filter[0].prefix.<.object_size_greater_than,rule[0].filter[0].prefix.<.object_size_less_than,rule[0].filter[0].prefix.<.and,rule[0].filter[0].prefix.<.tag]
is required

This will be an error in a future version of the provider

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgImFkZCI6IDIsICJjaGFuZ2UiOiA1LCAiZGVzdHJveSI6IDB9fQ==
```
</details>